## Trevor Arellanes - Module 4
## Data Analytics Fundamentals - 2/4/2023

## Task 1 -  Create a Data Frame

In [39]:
import pandas as pd

grades_dict = {'Wally' : [87, 96, 70], 'Eva' : [100, 87, 90], 'Sam' : [94, 77, 90], 'Katie' : [100, 81, 82], 'Bob' : [83, 65, 85]}

grades = pd.DataFrame(grades_dict)
# creating data frame

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

## Task 2 - Custom Index

In [40]:
grades.index = ['Test1', 'Test2', 'Test3']
grades # changes indices from integers to labels (test1 , test2)

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [41]:
grades['Eva']
# calls Eva's Grades

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [42]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

## Task 3 - Accessing Rows (loc, iloc)

In [43]:
grades.loc['Test1']
# returns data frame's test1 row grades

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [44]:
grades.iloc[1]
# returns grades using indices

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

In [45]:
grades.loc['Test1': 'Test3']
# using slice to call data ( this shows whole table)

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [46]:
grades.iloc[0:2]
# uses slice containing integer indices

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

In [47]:
grades.loc[['Test1', 'Test3']]
# isolates data by specific row using list notation

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [48]:
grades.iloc[[0, 2]]
# isolates data by using slice notation

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

## Task 3 - Accessing Subsets (at, iat)

In [49]:
grades.at['Test2', 'Eva']
# calls data from specific row and column using list notation

87

In [50]:
grades.iat[2, 0]
# calls dat using slice notation and integer indices

70

## Task 4 - Describe (By Column)

In [51]:
grades.describe()
# describe function used on datra frame

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

In [52]:
pd.set_option('display.precision', 2)
grades.describe()
# rounds data

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

## Task 5. Transpose (rows <--> Columns)

In [54]:
grades.T
# function transposes columns and rows

       Test1  Test2  Test3
Wally     87     96     70
Eva      100     87     90
Sam       94     77     90
Katie    100     81     82
Bob       83     65     85

In [55]:
grades.T.describe()

        Test1  Test2  Test3
count    5.00   5.00   5.00
mean    92.80  81.20  83.40
std      7.66  11.54   8.23
min     83.00  65.00  70.00
25%     87.00  77.00  82.00
50%     94.00  81.00  85.00
75%    100.00  87.00  90.00
max    100.00  96.00  90.00

## Task 6. Sort

In [56]:
grades.sort_index(ascending=False)
# sorts data in descinding order - note False

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

In [57]:
grades.sort_index(axis=1)
# sorts row indices

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70